<?php require "blocks/header.php"?>


<h1 class="h1-durov">Պավել Դուրով </h1>

<img src="img/durov1.jpg" alt="">
<img src="img/durov3.jpg" alt="">

<div class="new-div">
<p class="durov_p"> 
Պավել Վալերիևիչ Դուրով (ծնվ. հոկտեմբերի 10, 1984, Լենինգրադ), ռուս ձեռնարկատեր, ծրագրավորող, դոլարային միլիարդատեր։ VKontakte սոցիալական ցանցի և համանուն ընկերության, միջպլատֆորմային մեսենջերի Telegram-ի և այլ նախագծերի ստեղծողներից մեկը։ VKontakte-ի նախկին գործադիր տնօրեն (2006-2014)։ Ուսանողական տարիներին եղել է Ռուսաստանի Դաշնության Նախագահի և ՌԴ կառավարության կրթաթոշակների դափնեկիր, Պոտանինի անվան կրթաթոշակի եռակի դափնեկիր։ 2001 թվականին գերազանցությամբ ավարտել է Ակադեմիական գիմնազիան, 2006 թվականին՝ Սանկտ Պետերբուրգի պետական համալսարանի բանասիրական ֆակուլտետը՝ գերազանցությամբ անգլիական բանասիրության և թարգմանության բաժինը։ Ավարտելուց անմիջապես հետո նա ստեղծել է VKontakte-ն՝ Ռուսաստանի ամենամեծ սոցիալական ցանցն այս պահին։ 2011 թվականին նա 7,9 միլիարդ ռուբլի կարողությամբ զբաղեցրել է 350-րդ տեղը ռուս միլիարդատերերի վարկանիշում :  
</p>
</div>


<h1 class="h1-durov">Բիլ Գեյթս</h1>

<img src="img/gates.jpg" alt="">
<img src="img/gates3.jpg" alt="">

<div class="new-div">
<p class="durov_p">


Բիլ Գեյթսի ջանքերի շնորհիվ հաջողվել է ավելի քան 6 միլիոն կյանք փրկել։ Նա միշտ ամենաբարդ գործերը հանձնարարել է ամենաալարկոտ մարդկանց, քանի որ նրանք գտնում են դա անելու ամենապարզ միջոցը։Իր ահռելի ունեցվածքը Բիլ Գեյթսը կտակել է բարեգործական հիմնադրամներին՝ սեփական երեխաներին թողնելով ընդամենը 10-ական միլիոն ամերիկյան դոլար։
</p>

</div>


<h1 class="h1-durov">Մարկ  Ցուկերբերգ</h1>

<img src="img/facebook.jpg" alt="">
<img src="img/coding1.jpg" alt="">


<div class="new-div">
<p class="durov_p">
Մարկ  Ցուկերբերգը ամերիկացի ծրագրավորող: 2004թ. հիմնադրված Ֆեյսբուք սոցիալական ցանցի համահիմնադիրներից է և նրա գլխավոր տնօրենն է: 2014թ. Forbest Թոպ 15_ում զբաղեցրել է 14_րդ տեղը ունենալով 33,6 միլիարդ դոլար կարողություն: Ծնվել է Նյու Յորքում, կրթություն ստացել է Հարվարդի Համալսարանում, ուսանողների միլիարդավոր քանակով զբաղեցնում է առաջին տեղը: Ծնողներն են' Էդուարդ Ցուկերբերգը, Քարեն Ցուկերբերգը
</p>
</div>


<h1 class="h1-durov">Սթիվ Ջոբս</h1>

<img src="img/jobs.jpg" alt="">
<img src="img/jobs2.jpg" alt="">


<div class="new-div">
<p class="durov_p">

Սթիվեն Փոլ Ջոբսը ծնվել Կալիֆոռնիա նահանգի Մաունթին Վյու քաղաքում։ Մանկությունը և պատանեկությունը անցել է Փոլ Ջոբսի և Կլարա Ջոբսի (Կլարա Հակոբյան) ընտանիքում, ովքեր որդեգրել են նրան։
Դպրոցում հետաքրքրվել է էլեկտրոնիկայով, ծանոթացել Սթիվ Վոզնյակի հետ, ով դառնում է նրա գործընկերը՝ Apple ընկերությունում։ Նրանց առաջին համատեղ աշխատանքը նման էր հակերության, դա Բլյու բոքս-ն էր (անգլերենից՝ Կապույտ արկղիկ- սարք, որը թույլ էր տալիս կատարել անվճար զանգեր հեռավոր տարածքներ։ Հետագայում, ըստ լեգենդի նրանք զբաղվում էին դրա վաճառքով՝ Բերքլիում ուսման ժամանակ)
Սթիվեն Ջոբսը և Սթիվեն Վոզնյակը դարձան Էփլ ընկերության հիմնադիրներ։ Հիմնական նորարարությունների հեղինակը Սթիվեն Վոզնյակն էր, իսկ Ջոբսը զբաղվում էր շուկայով։
Համարվում է, որ Ջոբսը համոզեց Վոզնյակին ստեղծել միկրոհամակարգչի սխեման, որը զարգացման նոր ալիք հաղորդեց անձնական համակարգիչների շուկային։ Առաջին անձնական համակարգիչը, որը նրանք ներկայացրին Apple 1-ն էր, որը վաճառվեց 666 դոլար 66 ցենտով։ Որից հետո ստեղծվեց Apple 2-ը։ Այս երկու համակարգիչները Apple ընկերությանը դարձրին համակարգիչների շուկայի առանցքային դերակատարի։ 1980 թվականի դեկտեմբերին առաջին անգամ վաճառվեցին ընկերության ակցիաները, որը դարձրեց թիվ Ջոբսին մուլտիմիլիոնատեր։

</p>
</div>

<?php require "blocks/footer.php"?>