<?php require "blocks/header.php"?>

<h1 class="old_h1">ծերացող մասնագիտություն</h1>

<div class="new-div">
<p class="old_p">

Հեռախոսային օպերատորն այն մարդն է (օպերատորը), ով կատարում է միացում հեռախոսակայանում, այսինքն՝ միացնում է հեռախոսային բաժանորդներին հեռախոսագծով զանգահարելիս: Ռազմական գործերում հեռախոսավարը [զինվորական գրանցման մասնագիտություն է, պաշտոն և անձ, ով ունի դրանք և գտնվում է աշխարհի այս կամ այն պետության զինված ուժերի ազդանշանային զորքերում ։ Կա նաև ավագ հեռախոսավար։ Պատմություն Նախքան Ալմոն Ստրոուգերի կողմից ավտոմատ հեռախոսակայանի (PBX) գյուտը, հեռախոսային օպերատորների աշխատանքն օգտագործվում էր կանչված բաժանորդի հետ կապ հաստատելու հնարավորությունը գտնելու համար։ Հեռախոսային օպերատորների խումբը խոշոր քաղաքային անջատիչների մոտ կառավարվում էր ավագ հեռախոսային օպերատորի կողմից: -Շատ տարօրինակ զգացողություն։ Նստել մարզասրահի չափ սենյակում և խոսել հազարավոր մղոն հեռավորության վրա գտնվող մարդկանց հետ: Մեկ ժամվա ընթացքում առնվազն երեսունհինգ հոգի կլսեն ձեր ձայնը։ Բայց նրանց ոչինչ չես կարող ասել։ Նրանք քեզ չեն ճանաչում և երբեք չեն տեսնի: Եվ թվում է, թե դուք կորցնում եք մարդկանց: Կարծես մետաղադրամ են գցել մեքենայի մեջ, և այն քեզ դուրս է շպրտել: Դու անում ես այն, ինչ պետք է անես ու անհետանում ես։ Դուք ինքներդ թվում է, թե կողքին եք: Հեռախոսային օպերատորի աշխատանքը նույնպես այժմ պահանջված է. PBX-ների և Centrex-ի և վիրտուալ PBX-ների զանգվածային բաշխմամբ, զանգեր, որոնք ավտոմատ կերպով չեն մշակվում (օրինակ, զանգահարողը չգիտի տեղականը. համարը) գնալ օպերատորին: Փոքր ընկերություններում հեռախոսային օպերատորի պարտականությունները կատարում են՝ կես դրույքով, քարտուղարները: Առանց հավաքիչի հեռախոսները, որպես կանոն, օգտագործվում էին հաստատություններում, օրինակ՝ զորամասի անցակետում պահակները, որոնք կարող էին ծառայողական զանգ կատարել պահակախմբի պետին, ըստ կանոնադրության՝ պահակ չէր ենթադրվում. այլ բաժանորդների հետ շփվելու համար: Նաև հեռավոր գյուղական վայրերում և փոքր արդյունաբերական ձեռնարկություններում կարող էին տեղադրվել ոչ ավտոմատ հեռախոսակայաններ, 
բաժանորդը վերցրեց իր սարքի հեռախոսը, հեռախոսավարը պատասխանեց և ձեռքով միացավ մեկ այլ բաժանորդի: 

</p>
</div>
