<?php require "blocks/header.php"?>


<h1 class="new_h1"> ժամանակակից մասնագիտություն </h1>
<div class="new-div">
<p class="new_p">
Խոստումնալից ապագայի մասնագիտություններ արմատապես տարբերվում են այն տեսակներից, որոնք մեր նախնիները կարող էին ենթադրել: Աշխատանքի շուկայում իրավիճակը ամեն տարի փոխվում է, և հեղինակավոր մասնագիտությունները 5 տարի առաջ պարզապես ոչ ոքի անհրաժեշտություն չունի: Որոշ մասնագետներ փոխարինվում են բարձր տեխնոլոգիական մեքենաներով, մյուսները `ավելի էժան որակավորված աշխատուժով:Nano Medic
Նանոտեխնոլոգիան դյուրին կդարձնի ստեղծել ենթատոմիական մեխանիզմներ `փոքրիկ ռոբոտներ, որոնք կօգնեն բուժել հիվանդներին և անցկացնել կանխարգելիչ հետազոտություններ: Նման սարքավորումների հետ աշխատող մասնագետները պահանջարկ կունենան ամբողջ աշխարհում:

Գեն ֆերմերներն ու հովվապետերը
Գենետիկորեն ձևափոխված մթերքները խոստանում են լինել ինչպես համեղ, այնպես էլ առողջ: Օրինակ, հետագայում կլինեն մասնագետներ, որոնք կարող են լոլիկ աճեցնել տարբեր հիվանդությունների դեմ պատվաստանյութով, կամ մշակել կովի նոր ցեղատեսակ `սպիտակուցներով հարստացված բուժական կաթով:
Տիեզերական օդաչուներ, ճարտարապետներ և ուղեցույցներ
Տիեզերական հետախուզումը կբերի հսկայական եկամուտ և կստեղծի շատ աշխատատեղեր: Տիեզերական զբոսաշրջությունը կպահանջի օդաչուներ և ուղեցույցներ, իսկ Մարսի կամ Լուսնի նոր հյուրանոցները կպահանջեն համարձակ և վճռական ճարտարապետներ:

Ուղղահայաց ֆերմայի աշխատողներ
Տասը տարվա ընթացքում գյուղատնտեսությունը իրեն նոր տուն կգտնի `մեծ քաղաքներում երկնաքերեր: «Ուղղահայաց տնտեսությունների» գաղափարը կօգնի լուծել սննդի խնդիրը, ինչպես նաև զգալիորեն թեթևացնել հիմնական ճանապարհները: Նոր կազմավորման ֆերմերները կլինեն ճարտարագիտության, բուսաբանության և առևտրի ոլորտի մասնագետներ:

Կլիմայի փոփոխության մասնագետ
Բնապահպանական խնդիրները անխուսափելիորեն կհանգեցնեն կլիմայի փոփոխության: Ապագայում այս փոփոխությունների դեմ պայքարելու համար կուղարկվի աշխատողների մի ամբողջ բանակ: Նրանք ստիպված կլինեն իրականացնել մի քանի գեղեցիկ համարձակ նախագծեր. Օրինակ `տեղադրել հսկա հովանոցներ, արևի ճառագայթները արտացոլելու համար, կամ օվկիանոսի հատակը երկաթե ծածկոցներով ծածկելը, ինչը կօգնի պլանկտոնի և ջրիմուռների վերարտադրությանը ՝ մթնոլորտից վերցնելով ածխաթթու գազը:
</p>
</div>


<h1 class="new_h1"> Ծրագրավորում</h1>
 
<div class="new-div">
<p class="new_p">
Ծրագրավորում, համակարգչային ծրագրի ստեղծման գործընթաց։ Ըստ Նիկլաուս Վիրտի հայտնի արտահայտության, «Ծրագրեր = ալգորիթմներ + տվյալների կառուցվածքներ»[1]։ Այլ խոսքով, ծրագրավորման անմիջական խնդիրներն են ալգորիթմների և տվյալների կառուցվածքների ստեղծումը և կիրառումը։ Ավելի լայն իմաստով ծրագրավորումը հասկացվում է որպես ամբողջ գործունեություն, որը կապված է աշխատանքային միջավայրում ծրագրերի ստեղծման ու պահպանման՝ ծրագրային ապահովման հետ։ Այստեղ մտնում են խնդրի վերլուծությունն ու ներկայացումը, ծրագրի նախագծումը, ալգորիթմների կառուցումը, տվյալների կառուցվածքային մշակումը, ծրագրի տեքստի գրառումը, ծրագրի կարգավորումն ու տեստավորումը, փաստաթղթավորումը, ուրվագծումը, վերջնական մշակումը։ Ծրագրավորումը հիմնվում է ծրագրավորման լեզուների օգտագործման վրա, որոնցով գրառվում են հրահանգները համակարգչի համար։

Հին Հունաստանում անտիկիթերայի սարքն իր աշխատանքն ապահովող տարբեր չափերով ու կոնֆիգուրացիաներով ատամնանիվներ օգտագործող հաշվիչ էր։ Մինչ այժմ օգտագործվում է լուսնա-արեգակնային օրացույցներում։ Ալ-Ջազարին ստեղծել է այն 1206 թվականին։

Ծրագրավորման լեզուներից են՝ Python-ը, Ջավան, ՋավաՍկրիպտը և այլն։

Ծրագրավորողի աշխատանքի մեծ մասը կապված է ելակետային կոդի գրառման, ծրագրերի՝ ծրագրավորման լեզուներից մեկով ծրագրի թեստավորման ու կարգավորման հետ։ Ծրագրերի ելակետային տեքստերն ու օգտագործվող ֆայլերը համարվում են հեղինակային իրավունքի օբյեկտներ, նրանց հեղինակների ու իրավապաշտպանների մտավոր սեփականությունը։

Ծրագրավորման տարբեր լեզուներ ապահովում են ծրագրավորման տարբեր ոճերի օգտագործումը։ Մասամբ ծրագրավորման արվեստը նրանում է, որ պետք է ընտրել տրված խնդրի լուծման համար առավել հարմար ծրագրավորման լեզուն։ Տարբեր լեզուներ ծրագրավորողից պահանջում են ալգորիթմն իրականացնելու դետալների նկատմամբ ուշադրության տարբեր մակարդակներ, որի արդյունքը հաճախ լինում է համաձայնությունը ծրագրավորողի և օգտվողի միջև։
</p>

</div>

<h1 class="new_h1">Ծրագրավորման լեզուներ</h1>

<div class="new-div">
<p class="new_p">
Ծրագրավորման լեզու, նշանների համակարգ, որը նախատեսված է համակարգչային ծրագրեր գրելու համար[1][2]։ Ծրագրավորման լեզուն մեզ տալիս է որոշակի բառապաշար և քերականական կանոններ, որոնցից ելնելով ծրագրավորողը գրում է իր ծրագիրը։

Առաջին ԷՀՄ-ների ստեղծումից ի վեր ստեղծվել է ավելի քան 2500 տարբեր ծրագրավորման լեզուներ, և ամեն տարի դրանց թիվն ավելի է մեծանում։ Որոշ լեզուներից օգտվել կարողանում են միայն դրանք ստեղծողները, իսկ մյուսները հանրահայտ են դառնում միլիոնավոր մարդկանց։ Պրոֆեսիոնալ ծրագրավորողները իրենց աշխատանքում օգտագործում են նույնիսկ 10-ից ավելի ծրագրավորման լեզուներ։

Ծրագրավորման լեզվի նկարագրությունը սովորաբար կազմված է լինում երկու բաղկացուցիչներից՝ շարահյուսություն և իմաստաբանություն։ Որոշ ծրագրեր բացատրվում են մասնագրային փաստաթղթերով, օրինակ՝ C ծրագրավորման լեզուն մասնագիտացված է ISO ստանդարտով։ Perl 5-ը և այլ վաղ լեզուներ դոմինանտ իրականացում, ինչի շնորհիվ կիրառվում են որպես տեղեկագրություն։

Ծրագրավորման լեզուն նախատեսված է համակարգչային ծրագրեր գրելու համար, որոնք մի շարք կանոններ են, որոնք համակարգչին թույլ են տալիս կատարել որոշակի հաշվարկային գործընթաց, կազմակերպել տարբեր օբյեկտների կառավարում:Ծրագրավորման լեզուն տարբերվում է բնական լեզուներից, քանի որ այն նախագծված է համակարգիչները վերահսկելու համար, մինչդեռ բնական լեզուները հիմնականում օգտագործվում են մարդկանց միջև հաղորդակցվելու համար։ Ծրագրավորման լեզուների մեծամասնությունը օգտագործում են հատուկ կոնստրուկցիաներ ՝ տվյալների կառուցվածքները սահմանելու և շահարկելու և հաշվարկների գործընթացը վերահսկելու համար:Որպես կանոն, ծրագրավորման լեզուն սահմանվում է ոչ միայն այն լեզվական ստանդարտի բնութագրերի միջոցով, որը պաշտոնապես սահմանում է իր շարահյուսությունն ու իմաստաբանությունը,այլ նաև ստանդարտ- ծրագրային գործիքների ներդրման (իրականացման) միջոցով, որոնք ապահովում են այս լեզվով ծրագրերի թարգմանում կամ մեկնաբանություն:Նման ծրագրային գործիքները տարբերվում են արտադրողի, ապրանքանիշի և տարբերակի (վարկածի) տարբերակով, թողարկման ժամկետով, ստանդարտի իրականացման ամբողջականությամբ, լրացուցիչ հատկություններով:Կարող են լինել մարմնավորման որոշակի սխալներ կամ առանձնահատկություններ, որոնք ազդում են լեզվի կամ նույնիսկ դրա ստանդարտի օգտագործման պրակտիկայում:Ծրագրավորման լեզուն կարող է ներկայացվել մասնագրերի մի այնպիսի համակարգի տեսքով, որոնցով բնութագրվում են նրա շարահյուսությունն ու իմաստաբանությունը։
</p>
</div>

<h1 class="new_h1">  Գրաֆիկական դիզայն</h1>
 
<div class="new-div">
<p class="new_p">
 Գրաֆիկական դիզայնը տեսողական հաղորդակցության և խնդիրների լուծման գործընթաց է` պատկերների, լուսանկարչության, գծապատկերների և պատկերազարդման միջոցով: Գրաֆիկական դիզայնն ամենուր է՝ սկսած ցուցանակներից մինչև որևէ ընկերության պատկերանշան (logo) և համակարգչային լուծումներից մինչև վեբ կայքերի ձևավորում: Adobe Photoshop-ը և Illustrator-ը պատկերների խմբագրման հիմնական ծրագրերն են, որոնք մասնակիցները կուսումնասիրեն և կկիրառեն ստեղծագործական գործընթացում:
 </p>
</div>


<h1 class="new_h1">Հաքեր</h1>
 
<div class="new-div">
<p class="new_p">

Հաքեր կարելի է ասել 21 երրորդ դարի ամենապահանջված մասնագիտություններից մեկը։Սկզբնապես հաքերներ անվանել են ծրագրավորողներ, ովքեր ծրագրային ապահովման սխալներն էին ուղղում որևէ արագ կամ էլեգանտ միջոցով։ Hack բառը ծագել է հիպիների խոսակցականից։ հաքերները ըստ տեսակի երկուսն են սև և սպիտակ։Սև հաքերներին անվանում են կիբերհանցագործներ,պատճառ այն է որ մինչ սպիտակ հաքերները ոչնչացում էն ծրագրային սխալները սև հաքերները այն ստեղծում էն։ Ւսկ սպիտակ հաքերները ոգնելով ոստիկանությանը պաշտպանում են ծրագրերը վիրուսներից։
 </p>
</div>

